[M_MyDeadBrother MissionDefinition]
MissionDescription="A little guide named Simon arrived. Thanks to Simon, he now has the ability to raise the dead (he says), and unless the curse is lifted (he doesn't), you'll be dead in a week. Simon will agree to lift the curse if you find him and save the dead Simon Edgar.."
MissionSummary="Help the witch Simon find her brother's body."

[M_MyDeadBrother:ObjSet_ChooseSide MissionObjectiveSetBranchingDefinition]
MissionDescriptionOverride="A little guide named Simon arrived. Thanks to Simon, he now has the ability to raise the dead (he says), and unless the curse is lifted (he doesn't), you'll be dead in a week. Simon will agree to lift the curse if you find him and save the dead Simon Edgar.. You revived Edgar, who asked you to kill his brother instead of him. Simon, of course, has asked that you kill Edgar. The choice, as always, is yours."
